# ElevationSketchNotAllowed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ElevationSketchNotAllowed Property
BuiltInFailures..::..SketchFailures Class See Also
---
Wall in a family can't have an elevation profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElevationSketchNotAllowed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElevationSketchNotAllowed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElevationSketchNotAllowed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace